## Pandas is a library for data manipulation and data analysis

In Pandas, DataFrame is a two-dimensional, potentially **heterogeneous** tabular data structure [can hold different data types (integer, float, string, etc.) across different columns] with **labeled axes** (rows and columns) and **size-mutable** (can add or drop rows and columns). that is a table in a database or a sheet in an Excel spreadsheet.

DataFrames can be create from various data structures, like dictionaries, lists, or other DataFrames.

[pandas documentation](https://pandas.pydata.org/docs)

In [86]:
!pip install pandas

Requirement already satisfied: pandas in c:\python312\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\python312\lib\site-packages (from pandas) (2.2.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [87]:
import pandas as pd

In [88]:
data = { 
    'Name': ['Alice', 'Bob', 'Charlie'], 
    'Age': [25, 30, 35], 
    'City': ['New York', 'San Francisco', 'Los Angeles'] 
} 
df = pd.DataFrame(data)
print(df) # here you can see DataFrame Feature to hold **Heterogeneous Data**

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

Viewing Data

In [89]:
df.head()

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

#### Here you can see DataFrame Feature to hold **two-dimensional** and accessing with help of same

In [90]:
# Get the total count of rows and columns 
total_rows, total_columns = df.shape 
print(f"Total rows: {total_rows}") 
print(f"Total columns: {total_columns}")

Total rows: 3
Total columns: 3

## Reading and Writing Data
we can read file data as dataframe
and after performing operations wwrite it back to some file
```python
df = pd.read_csv('data.csv')
# some operations
df.to_csv('output.csv', index=False)
```

We will start working on created DataFrame to understand features and functionality

#### Here you can see DataFrame Feature to hold **Labeled Axes** and accessing with help of same
### Accessing Column Data

In [91]:
names = df['Name'] # single column
names

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [92]:
column_list = ['Name', 'Age']
names_and_ages = df[column_list] # multiple columns
names_and_ages

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

### Accessing Row Data

**`loc`** is label-based 
Uses labels to select data. Ideal when you have meaningful row and column names.

In [93]:
# Select row with row 1 
row1 = df.loc[1] 
print(row1)

Name              Bob
Age                30
City    San Francisco
Name: 1, dtype: object

In [94]:
# Select rows with row 1 and 2 
rows12 = df.loc[1:2] 
print(rows12)

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [95]:
# Select rows with row 1 to 2 and column 'Age' 
value = df.loc[1:2, 'Age'] 
print(value)

1    30
2    35
Name: Age, dtype: int64

**`iloc`** is integer position-based
Uses integer positions to select data. Ideal for purely positional indexing

In [96]:
# Select the second row (index 1) 
row = df.iloc[1] 
print(row)

Name              Bob
Age                30
City    San Francisco
Name: 1, dtype: object

In [97]:
# Select the first two rows (index 0 and 1) 
rows = df.iloc[0:2] 
print(rows)

    Name  Age           City
0  Alice   25       New York
1    Bob   30  San Francisco

In [98]:
# Select the value in the second row and second column 
value = df.iloc[1, 1]
print(value)

30

#### Here you can see DataFrame Feature to hold **Size-Mutable** that is to add or drop rows and columns 
## Adding Row
### Using **`loc`** to add row

In [99]:
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [100]:
# Adding a new row 
df.loc[len(df)] = ['Drake', 32, 'Texas'] 
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    Drake   32          Texas

#### Using **`concat()`** for adding multiple rows

In [101]:
new_dataframe = pd.DataFrame(
    { 
        'Name': ['Fred', 'Gwen', 'Harry'], 
        'Age': [37, 24, 26], 
        'City': ['San Diego', 'New Jersey', 'Washington'] 
    }
)
df = pd.concat([df, new_dataframe], ignore_index=True)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    Drake   32          Texas
4     Fred   37      San Diego
5     Gwen   24     New Jersey
6    Harry   26     Washington

## Adding Columns
#### Using **`insert()`**

In [102]:
total_rows, total_columns = df.shape 
new_column_index = total_columns 
column_name = 'Country'
column_default_value = ['USA'] * total_rows

df.insert(new_column_index, column_name, column_default_value)
df

      Name  Age           City Country
0    Alice   25       New York     USA
1      Bob   30  San Francisco     USA
2  Charlie   35    Los Angeles     USA
3    Drake   32          Texas     USA
4     Fred   37      San Diego     USA
5     Gwen   24     New Jersey     USA
6    Harry   26     Washington     USA

#### Using **`assign()`**

In [103]:
# Adding multiple columns using assign 
df = df.assign(Adult=lambda x: ['Yes' if age > 18 else 'No' for age in x['Age']], Skills=['Python']*df.shape[0]) 
print(df)

      Name  Age           City Country Adult  Skills
0    Alice   25       New York     USA   Yes  Python
1      Bob   30  San Francisco     USA   Yes  Python
2  Charlie   35    Los Angeles     USA   Yes  Python
3    Drake   32          Texas     USA   Yes  Python
4     Fred   37      San Diego     USA   Yes  Python
5     Gwen   24     New Jersey     USA   Yes  Python
6    Harry   26     Washington     USA   Yes  Python

## Dropping Row
#### Using **```drop()```** method by **index**

In [104]:
df.drop(index=1, axis=0, inplace=True) # Drop the single row with index 1 
print(df)

      Name  Age         City Country Adult  Skills
0    Alice   25     New York     USA   Yes  Python
2  Charlie   35  Los Angeles     USA   Yes  Python
3    Drake   32        Texas     USA   Yes  Python
4     Fred   37    San Diego     USA   Yes  Python
5     Gwen   24   New Jersey     USA   Yes  Python
6    Harry   26   Washington     USA   Yes  Python

In [105]:
df.drop(index=[0, 2], axis=0, inplace=True) # Drop multiple rows with index 0 and 2 
print(df)

    Name  Age        City Country Adult  Skills
3  Drake   32       Texas     USA   Yes  Python
4   Fred   37   San Diego     USA   Yes  Python
5   Gwen   24  New Jersey     USA   Yes  Python
6  Harry   26  Washington     USA   Yes  Python

In [106]:
df = df[df['Age'] <= 30] # Dropping rows based on a condition Keep only rows where Age <= 30
print(df)

    Name  Age        City Country Adult  Skills
5   Gwen   24  New Jersey     USA   Yes  Python
6  Harry   26  Washington     USA   Yes  Python

## Dropping Columns
#### Using **```drop()```** method with **axis=1**

drop columns, you use the drop method with axis=1 & Drop Multiple Columns

In [107]:
# Dropping a single column 
df.drop('Country', axis=1, inplace=True)
df

    Name  Age        City Adult  Skills
5   Gwen   24  New Jersey   Yes  Python
6  Harry   26  Washington   Yes  Python

In [108]:
# Dropping multiple columns 
df.drop(['Adult', 'Skills'], axis=1, inplace=True) 
print(df)

    Name  Age        City
5   Gwen   24  New Jersey
6  Harry   26  Washington

## Filtering rows in a DataFrame using conditions

In [109]:
# Filter rows where Age is greater than 25
filtered_df = df[df['Age'] > 25]
print(filtered_df)

    Name  Age        City
6  Harry   26  Washington

Filtering Rows Based on Multiple Conditions

In [110]:
# Filter rows where Age is greater than 20 and City is 'New York'
filtered_df = df[(df['Age'] > 20) & (df['City'] == 'New York')]
print(filtered_df)

# Filter rows where Age is less than 25 or City is 'Chicago'
filtered_df = df[(df['Age'] < 25) | (df['City'] == 'Chicago')]
print(filtered_df)

Empty DataFrame
Columns: [Name, Age, City]
Index: []
   Name  Age        City
5  Gwen   24  New Jersey

Filtering Rows Using isin Method

In [111]:
# Filter rows where City is either 'New York' or 'Boston'
filtered_df = df[df['City'].isin(['New York', 'Boston'])]
print(filtered_df)

Empty DataFrame
Columns: [Name, Age, City]
Index: []

Filtering Rows Using String Methods

In [112]:
# Filter rows where the Name starts with 'A'
filtered_df = df[df['Name'].str.startswith('A')]
print(filtered_df)

# Filter rows where the City contains 'o'
filtered_df = df[df['City'].str.contains('o')]
print(filtered_df)

Empty DataFrame
Columns: [Name, Age, City]
Index: []
    Name  Age        City
6  Harry   26  Washington

Filtering Rows with Missing Values

In [113]:
# Adding a row with missing value
df.loc[5] = ['Frank', None, 'Seattle']

# Filter rows where Age is not null
filtered_df = df[df['Age'].notnull()]
print(filtered_df)

    Name   Age        City
6  Harry  26.0  Washington

Descriptive Statistics : ```describe()``` method generates summary statistics for numerical columns

In [114]:
print(df) 
# Descriptive statistics
print(df.describe())

    Name   Age        City
5  Frank   NaN     Seattle
6  Harry  26.0  Washington
        Age
count   1.0
mean   26.0
std     NaN
min    26.0
25%    26.0
50%    26.0
75%    26.0
max    26.0

Column-specific Descriptive Statistics

In [115]:
total_rows, total_columns = df.shape 
new_column_index = total_columns 
column_name = 'Salary'

import random

# Generate a list of 10 random 6-digit numbers 
column_default_value = [random.randint(100000, 999999) for _ in range(total_rows)]

df.insert(new_column_index, column_name, column_default_value)

df

    Name   Age        City  Salary
5  Frank   NaN     Seattle  977934
6  Harry  26.0  Washington  577311

In [116]:
print("Mean Salary:", df['Salary'].mean())
print("Median Salary:", df['Salary'].median())
print("Standard Deviation of Salary:", df['Salary'].std())
print("Minimum Salary:", df['Salary'].min())
print("Maximum Salary:", df['Salary'].max())

Mean Salary: 777622.5
Median Salary: 777622.5
Standard Deviation of Salary: 283283.23999929824
Minimum Salary: 577311
Maximum Salary: 977934

Value Counts

In [117]:
print(df['Name'].value_counts())

Name
Frank    1
Harry    1
Name: count, dtype: int64

For categorical data, you can use the ```describe(include=[object])``` method to get a summary

In [ ]:
# Add a categorical column
df['Department'] = ['HR', 'Finance', 'IT']

print(df.describe(include=[object]))

ValueError: Length of values (3) does not match length of index (2)

:

Count of Missing Values

In [53]:
print(df.isnull().sum())

Name          0
Age           1
City          0
Salary        0
Department    0
dtype: int64

In [55]:
df

    Name   Age        City  Salary Department
0  Alice  25.0    New York  109117         HR
5  Frank   NaN     Seattle  385460    Finance
6  Harry  26.0  Washington  590581         IT

Correlation

In [54]:
print(df.corr())

ValueError: could not convert string to float: 'Alice'

Identifying Missing Data

In [57]:
# Identifying missing data 
print(df.isnull()) 
print(df.isnull().sum())

    Name    Age   City  Salary  Department
0  False  False  False   False       False
5  False   True  False   False       False
6  False  False  False   False       False
Name          0
Age           1
City          0
Salary        0
Department    0
dtype: int64

Dropping Missing Data

In [58]:
df_dropped = df.dropna()
print(df_dropped) # Drop rows with any missing values

    Name   Age        City  Salary Department
0  Alice  25.0    New York  109117         HR
6  Harry  26.0  Washington  590581         IT

Drop rows with all missing values

In [59]:
df_dropped_all = df.dropna(how='all')
print(df_dropped_all)

    Name   Age        City  Salary Department
0  Alice  25.0    New York  109117         HR
5  Frank   NaN     Seattle  385460    Finance
6  Harry  26.0  Washington  590581         IT

Drop columns with any missing values

In [60]:
df_dropped_columns = df.dropna(axis=1)
print(df_dropped_columns)

    Name        City  Salary Department
0  Alice    New York  109117         HR
5  Frank     Seattle  385460    Finance
6  Harry  Washington  590581         IT

Filling Missing Data

In [61]:
df

    Name   Age        City  Salary Department
0  Alice  25.0    New York  109117         HR
5  Frank   NaN     Seattle  385460    Finance
6  Harry  26.0  Washington  590581         IT

In [62]:
print(df.fillna(20)) # Fill missing values with a specific value

    Name   Age        City  Salary Department
0  Alice  25.0    New York  109117         HR
5  Frank  20.0     Seattle  385460    Finance
6  Harry  26.0  Washington  590581         IT

In [67]:
# Fill missing values without using inplace 

# Fill with mean
df_fill_data = df['Age'].fillna(df['Age'].mean())
print(df_fill_data)

# Fill with median
df_fill_data = df['Age'].fillna(df['Age'].median())
print(df_fill_data)


# Fill with mode 
df_fill_data = df['Age'].fillna(df['Age'].mode()[0])
print(df_fill_data)

0    25.0
5    25.5
6    26.0
Name: Age, dtype: float64
0    25.0
5    25.5
6    26.0
Name: Age, dtype: float64
0    25.0
5    25.5
6    26.0
Name: Age, dtype: float64

Forward Fill and Backward Fill

In [69]:
# Forward fill 
df_ffill = df.ffill() 
print("After forward fill:\n", df_ffill)

# Backward fill
df_bfill = df.bfill()
print("After backward fill:\n", df_bfill)

After forward fill:
     Name   Age        City  Salary Department
0  Alice  25.0    New York  109117         HR
5  Frank  25.5     Seattle  385460    Finance
6  Harry  26.0  Washington  590581         IT
After backward fill:
     Name   Age        City  Salary Department
0  Alice  25.0    New York  109117         HR
5  Frank  25.5     Seattle  385460    Finance
6  Harry  26.0  Washington  590581         IT

Interpolating Missing Data

In [73]:
# Convert object dtype to appropriate types 
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, None, 35], 'City': ['New York', 'San Francisco', None]}).infer_objects(copy=False) 
df = df.infer_objects(copy=False)

# Interpolating missing data 
df_interpolated = df.interpolate() 
print(df_interpolated)

      Name   Age           City
0    Alice  25.0       New York
1      Bob  30.0  San Francisco
2  Charlie  35.0           None

C:\Users\jaid_\AppData\Local\Temp\ipykernel_3456\3602127782.py:5: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df_interpolated = df.interpolate()

Grouping and aggregating data in Pandas are powerful techniques for summarizing and analyzing your data. The groupby method in Pandas allows you to group data by one or more columns and then perform aggregate operations on these groups

In [74]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Department': ['HR', 'Finance', 'IT', 'HR', 'Finance', 'IT'],
    'Salary': [50000, 60000, 70000, 45000, 52000, 68000],
    'Age': [25, 30, 35, 28, 22, 40]
}
df = pd.DataFrame(data)

Grouping Data
group the DataFrame by a column (or columns) using groupby. For example, to group by the 'Department' column

In [75]:
grouped = df.groupby('Department')

Aggregating Data
grouped data, can perform aggregate operations such as sum, mean, count, etc. Here are some common aggregate functions

In [76]:
# sum
salary_sum = grouped['Salary'].sum()
print(salary_sum)

# mean
salary_mean = grouped['Salary'].mean()
print(salary_mean)

# count
count = grouped['Salary'].count()
print(count)

Department
Finance    112000
HR          95000
IT         138000
Name: Salary, dtype: int64
Department
Finance    56000.0
HR         47500.0
IT         69000.0
Name: Salary, dtype: float64
Department
Finance    2
HR         2
IT         2
Name: Salary, dtype: int64

Multiple Aggregations: You can perform multiple aggregations at once using the agg method

In [77]:
aggregations = grouped['Salary'].agg(['sum', 'mean', 'max', 'min'])
print(aggregations)

               sum     mean    max    min
Department
Finance     112000  56000.0  60000  52000
HR           95000  47500.0  50000  45000
IT          138000  69000.0  70000  68000

Grouping by Multiple Columns

In [78]:
multi_grouped = df.groupby(['Department', 'Age'])

Custom Aggregations

In [79]:
custom_agg = grouped['Salary'].agg(lambda x: x.max() - x.min())
print(custom_agg)

Department
Finance    8000
HR         5000
IT         2000
Name: Salary, dtype: int64

Merging and Joining DataFrames


Merging: Use merge for combining DataFrames based on common columns.

Joining: Use join for combining DataFrames based on index.


Merging DataFrames
The merge function is used to combine two DataFrames based on a common column or index.

In [80]:
import pandas as pd

# Sample DataFrames
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['A', 'B', 'D'], 'value2': [4, 5, 6]})

# Inner join default
merged_df = pd.merge(df1, df2, on='key')
print("Inner Join:\n", merged_df)

Inner Join:
   key  value1  value2
0   A       1       4
1   B       2       5

In [81]:
# Left join
left_joined_df = pd.merge(df1, df2, on='key', how='left')
print("Left Join:\n", left_joined_df)

Left Join:
   key  value1  value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [82]:
# Right join
right_joined_df = pd.merge(df1, df2, on='key', how='right')
print("Right Join:\n", right_joined_df)

Right Join:
   key  value1  value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6

In [83]:
# Outer join
outer_joined_df = pd.merge(df1, df2, on='key', how='outer')
print("Outer Join:\n", outer_joined_df)

Outer Join:
   key  value1  value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

Joining DataFrames

In [84]:
# Sample DataFrames with index
df1 = df1.set_index('key')
df2 = df2.set_index('key')

# Simple Join
joined_df = df1.join(df2)
print("Simple Join:\n", joined_df)

Simple Join:
      value1  value2
key
A         1     4.0
B         2     5.0
C         3     NaN

In [85]:
# Left join
left_joined_df = df1.join(df2, how='left')
print("Left Join:\n", left_joined_df)

# Right join
right_joined_df = df1.join(df2, how='right')
print("Right Join:\n", right_joined_df)

# Outer join
outer_joined_df = df1.join(df2, how='outer')
print("Outer Join:\n", outer_joined_df)

Left Join:
      value1  value2
key
A         1     4.0
B         2     5.0
C         3     NaN
Right Join:
      value1  value2
key
A       1.0       4
B       2.0       5
D       NaN       6
Outer Join:
      value1  value2
key
A       1.0     4.0
B       2.0     5.0
C       3.0     NaN
D       NaN     6.0